# Lab 11 BGP Управление анонсами

Задачи лабораторной работы:  

1. Настроить фильтрацию в офисе Москва так, чтобы не появилось транзитного трафика(As-path).
2. Настроить фильтрацию в офисе С.-Петербург так, чтобы не появилось транзитного трафика(Prefix-list).
3. Настроить провайдера Киторн так, чтобы в офис Москва отдавался только маршрут по умолчанию.
4. Настроить провайдера Ламас так, чтобы в офис Москва отдавался только маршрут по умолчанию и префикс офиса С.-Петербург.

### 1 Настроить фильтрацию в офисе Москва так, чтобы не появилось транзитного трафика(As-path)
Чтобы трафик не был транзитным, АС должна отдавать только свои префиксы, те оригинированные в ней.
Сл-но, регулярным выражением выбираем последнюю подстроку в строке AS_Path.
При анонсировании префикса из АС собственная ASN подставляется в AS_PATH уже после прохождения всех фильтров, 
поэтому при фильтрации префиксов в исходящем из АС направлении в filter-list нужно использовать регулярное выражение ^$, то есть "пустая строка"
На пограничных роутерах R14 и R15 настраиваем:
```
ip as-path access-list 1 permit ^$
router bgp 1001
neighbor 11.0.0.1 filter-list 1 out

R14#sho ip bgp ipv4 unicast neighbors 11.0.0.1 advertised-routes
     Network          Next Hop            Metric LocPrf Weight Path
 r>i  12.12.12.12/32   10.0.0.1                 0    100      0 i
 r>i  13.13.13.13/32   102.0.0.2                0    100      0 i
 *>   14.14.14.14/32   0.0.0.0                  0         32768 i
 r>i  15.15.15.15/32   10.0.1.4                 0    200      0 i
 *>   19.19.19.19/32   10.0.2.1                 0         32768 i
 r>i  20.20.20.20/32   10.0.1.4                 0    200      0 i
 r>i  192.168.0.0      10.0.0.1                 0    100      0 i
 r>i  192.168.1.0      10.0.0.1                 0    100      0 i

```
### 2 Настроить фильтрацию в офисе С.-Петербург так, чтобы не появилось транзитного трафика(Prefix-list)
Аналогично п.1, только настраиваем через prefix list на R18. Назначаем prefix-list для соседа на каждом линке.
```
ip prefix-list 1 seq 5 permit 192.168.8.0/24
ip prefix-list 1 seq 10 permit 192.168.9.0/24
router bgp 2042
 neighbor 14.0.4.2 prefix-list 1 out
 neighbor 14.0.5.2 prefix-list 1 out
```
### 3. Настроить провайдера Киторн так, чтобы в офис Москва отдавался только маршрут по умолчанию
При анонсировании дефолта командой neighbor ... default-originate этот префикс проходит любые исходящие фильтры. 
Поэтому для анонсирования ТОЛЬКО дефолта можно повесить на выход фильтр, который запрещает любые префиксы.
На роутере R22 настраиваем:
```
ip prefix-list 1 seq 5 deny 0.0.0.0/0 le 32
router bgp 101
 bgp log-neighbor-changes
 neighbor 11.0.0.2 default-originate
 neighbor 11.0.0.2 prefix-list 1 out

R22#sho ip bgp ipv4 unicast neighbors 11.0.0.2 advertised-routes
Originating default network 0.0.0.0
     Network          Next Hop            Metric LocPrf Weight Path
Total number of prefixes 0
```
### 4. Настроить провайдера Ламас так, чтобы в офис Москва отдавался только маршрут по умолчанию и префикс офиса С.-Петербург
На роутере R21 мы отдаем маршрут по умолчанию и префиксы СПБ.
```
ip as-path access-list 1 permit _2042_$

router bgp 301
 neighbor 12.0.0.2 default-originate
 neighbor 12.0.0.2 filter-list 1 out

R21#sho ip bgp ipv4 unicast neighbors  12.0.0.2 advertised-routes
Originating default network 0.0.0.0
     Network          Next Hop            Metric LocPrf Weight Path
 *>   192.168.8.0      12.0.1.2                               0 2222 2042 i
 *>   192.168.9.0      12.0.1.2                               0 2222 2042 i
```

[Лаба](./_lab11.zip)












